//DB20SQL  PROC  LISTA='*',AMBL=P,AMBP=0,DUD=Y,EXCL='',CEN=,CENN=,
//         TESTLIB=
//MYSET SET AMBL=P NEUTRALIZZO PARAMETRO AMBL
//*****************************************************************
//*    PROCEDURA DI ESECUZIONE DINAMICA DEGLI STATEMENTS DI SQL
//*    ESECUZIONE DI DSNTEP
//*****************************************************************
//P0     EXEC PGM=IKJEFT01,PARM=(REXDEPUR,&DB2,&EXCL),REGION=0M
//STEPLIB  DD DSN=Y&CENN.&AMBP.0DB2.PE000.&DB2..DSNEXIT,DISP=SHR
//         DD DSN=Y&CENN.&AMBP.0DB2.PE000.&DB2..DSNLOAD,DISP=SHR
//         DD DSN=Y&CENN.&AMBP.0DB2.PE000.&DB2..RUNLIB.LOAD,DISP=SHR
//         DD DSN=L&CEN.&AMBL.0Y.TBAN0000.LOADBATC,DISP=SHR
//*
//SYSPROC  DD DISP=SHR,DSN=L&CEN&AMBL.00.SYSTEM.INPUT&TESTLIB
//SYSEXEC  DD DISP=SHR,DSN=L&CEN&AMBL.00.SYSTEM.INPUT&TESTLIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//OUT      DD DSN=&&SQL,DISP=(,PASS),
//       DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//       SPACE=(CYL,50)
//*
//P1     EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE,P0),REGION=8M
//STEPLIB DD DSN=Y&CENN.&AMBP.0DB2.PE000.&DB2..DSNLOAD,DISP=SHR
//        DD DSN=Y&CENN.&AMBP.0DB2.PE000.&DB2..RUNLIB.LOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=&LISTA
//SYSIN DD DSN=&&SQL,DISP=(OLD,DELETE)
//SYSUDUMP DD SYSOUT=D
//SYSTSIN  DD DSN=L&CEN.&AMBL.00.SYSTEM.INPUT.DB2&TESTLIB(&DB2.CMD),
//            DISP=SHR
//         DD DSN=L&CEN.&AMBL.00.SYSTEM.INPUT.DB2&TESTLIB(DSNTEP),
//            DISP=SHR
//*----------------------------------------------------------------*//
//*  FACCIO PASSO DI DUD O NO
//*----------------------------------------------------------------*//
//P1TD     EXEC PGM=IKJEFT01,PARM=('REXCFRYN,&DUD,Y')
//SYSEXEC  DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB,DISP=SHR
//SYSPROC  DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB,DISP=SHR
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*
// IF   (P0.RC > 0) OR ((P1TD.RC = 0) AND (P1.RC > 4))  THEN
//P1DUD   EXEC DB20DUD,
//        RTC='04',
//        OPE='<',
//        CEN=&CEN
// ENDIF
//******************** FINE PROC.DB20SQL **************************
