//DB20JOBS  PROC DESC='XXX',SUB=NO,HOLD=NO,MSGCLASS=I,CLASS=G,
//     FILTRO=,CEN=,TYPE=GEN,CHIUSI=ABEND,DUD=N,AMBL=P,MON=N,PARLL=NO,
//     FSCHV=,WAITM=180,MAIL=NO,MAILB=MDB1,MAILTXT=,MAXP=9,
//     AUTH=CPTURN,
//     REPORT=NO,CONVERTI=Y,MAXRC=8,FORZACNV=N,START=N,TESTLIB=
//*
//MYSET SET AMBL=P NEUTRALIZZO PARAMETRO AMBL
//**********************************************************************
//* CONSENTE DI ESEGUIRE UN JCL CHE VIENE FORNITO IN INPUT SU TUTTI
//* I DB2 DI PRODUZIONE, SVILUPPO, AMVS, FIDEURAM
//* IL PERIMETRO DEI DB2 VIENE DETERMINATO DA 'AMB', 'FILTRO', 'TYPE',
//* 'CHIUSI' E AFFINATO CON GLI INPUT 'INCLUDE' ED 'EXCLUDE'
//*
//* TRAMITE TWS LANCIA DEI JOB TRACKER (G@GDXXX# EXEC REXSUB02)
//* SU OGNI CENTRO PREVISTO, CHE ESEGUONO:
//* - SUBMIT VIA INTERNAL READER DEI JOB
//* - FORZATURA PARTENZA (TRAMITE COMANDO /$SJ)
//* - MONITORAGGIO TRAMITE ADDRESS SDSF
//* - TRACCIAMENTO DEI JOB SU AYY2.MONITOR_DB20JOBS
//*
//* SE MON=Y, LA DB20JOBS INTERROGA AYY2.MONITOR_DB20JOBS PER IL
//* MONITORAGGIO DI TUTTI I JOB SOTTOMESSI
//*
//* REPORTISTICA PREVISTA:
//* - CONTROLLO SU ESECUZIONE DEI JOB TRACKER
//* - AVVISO DI JOB ANCORA IN ESECUZIONE
//* - REPORTISTICA FINALE JOB SOTTOMESSI (REPORT=YES)
//*
//* PARAMETRI:
//*  DESC   : 3 CARATTERI UTILIZZATI PER IL JOBNAME, I PRIMI 4
//*           CORRISPONDONO AL DB2, POI QUESTI 3, L'ULTIMO E' 'X'
//*  SUB    : SE GLI OGGETTI CREATI VANNO SOTTOMESSI, DEFAULT=NO
//*           SE SUB=NO LIBJOB =X000DB2.PE000.TWS.SUPTEC.DB20JOBS
//*  HOLD   : SE I JOBS CREATI DEVONO AVERE TYPRUN=HOLD, DEFAULT=NO
//*  AMB    : AMBIENTE SU CUI LANCIARE I JOBS. 'PROD','TEST' O 'ALL'
//*  MSGCLASS: MSGCLASS DEI JOBS CHE DEVONO ESSERE CREATI
//*  CLASS: CLASS DEI JOBS CHE DEVONO ESSERE CREATI (SOLO TARGET)
//*  FILTRO : PERMETTE DI FILTRARE I DB2 SU CUI LANCIARE I JOBS.
//*           IL FILTRO VIENE PASSATO AL PGM REXTABDB CHE ESTRAE I DATI
//*           DALLA TABDB2. ES:
//*           FILTRO=CEN(C)     LANCIA I JOBS SOLO PER I DB2 DI AMVS
//*           FILTRO=SOC(SC)    LANCIA I JOBS SOLO DI BANCA ISP
//*           FILTRO=VERS(AN)   LANCIA I JOBS SOLO PER I DB2 IN V10 NFM
//*           FILTRO=CEN(*ALL*) LANCIA I JOBS SU TUTTI I DB2 DI TABDB2
//*           -> IN QUESTO CASO USARE ATTENTAMENTE INCLUDE ED EXCLUDE
//*           FILTRO='(CEN(O) AND NOT SOC(SC)' LANCIA I JOBS SUI CLONI
//*           -> LANCIA I JOBS SUI CLONI TARGET ECCETTO ISP
//*           -> IN QUESTO CASO SI USANO DELLE KEYWORD PER COMBINARE
//*              PI` PARAMETRI PER ESTRARRE CIÝ CHE INTERESSA. PER
//*              DETTAGLI CONSULTARE LA DOC.
//*                'REXX - REXTABDB LETTURA TABDB2.DOCX'
//*  TYPE   : INDICA IL TIPO DI RICERCA DEI DB2 CHE DEVE FARE:
//*           GEN: UN JOB PER OGNI SHARING GROUP
//*           IST: UN JOB PER ISTANZA DB2
//*  CHIUSI : INDICA COSA FARE SE SI TROVANO DB2 TEMPORANEAMENTE CHIUSI:
//*           ABEND (DEF.): VA IN ABEND SEGNALANDO I DB2 CHIUSI
//*           NO          : NON LANCIA IL JOB SUI DB2 CHIUSI
//*           YES         : LANCIA LO STESSO IL JOB SUI DB2 CHIUSI
//*  DUD    : INDICA SE MANDARE IL JOB IN ABEND IN CASO DI RETURN CODE
//*           MAGGIORE DI 4
//*  MON    : INDICA SE I JOBS LANCIATI SARANNO MONITORATI (Y/N)
//*  START  : SE Y IL MONITORAGGIO TERMINA QUANDO TUTTI I JOB
//*           SONO PARTITI
//*  AMBL   : USATO PER STEPLIB DEL DUD, VALE SEMPRE 'P'
//*           L…CENŠ.…AMBLŠ0Y.TBAN0000.LOADBATC
//*  FSCHV  : DA UTILIZZARE PER AVERE UNO SPECIFICO SCHENV NEI JOB
//*  PARLL  : PERMETTE DI ESEGUIRE IN PARALLELO PI` STEP FORNITI IN
//*           INPUT (DEFAULT 'NO')
//*  WAITM  : WAIT TIME ESPRESSO IN MINUTI PER ATTESA FINE JOB LANCIATI
//*  MAIL   : INDICA SE IN CASO DI ERRORE I JOB LANCIATI DEVONO INVIARE
//*           UNA MAIL TRAMITE DB20DUD ('NO', 'YES', 'ALL')
//*           NO  -> SOLO ABEND DEL JOB (DEFAULT)
//*           YES -> SOLO MAIL SENZA ABEND DEL JOB
//*           ALL -> MAIL E ABEND DEL JOB
//*  MAILB  : INDICA L'EVENTUALE DESTINATARIO DELLA MAIL
//*  MAILTXT: INDICA L'EVENTUALE TESTO NELL'OGGETTO DELLA MAIL
//*  MAXP   : INDICA IL NUMERO MASSIMO DI JOB LANCIATI CHE POSSONO
//*           GIRARE CONTEMPORANEAMENTE. QUELLI IN PI` VERRANNO ACCODATI
//*  REPORT : MAIL DI FINE MONITORAGGIO CON STATISTICHE JOB
//*  CONVERTI:SE VALE 'N' LASCIA IL JOB COME E' PASSATO SENZA MODIFICHE
//*  MAXRC  : DEFINISCE PER QUALE RETURN CODE DEVE SCATTARE IL DUD
//*  FORZACNV : FORZA CONVERSIONE DEI VECCHI TAG DEPRECATI (DB0A,Y100..)
//*
//* FILES IN INPUT:
//*  INCLUDE: CONTIENE SPECIFICI DB2 SU CUI CREARE I JOBS; IN QUESTO
//*           CASO NON LO CREA SUGLI ALTRI (DEFAULT DUMMY, CIOE' LI
//*           CREA SU TUTTI)
//*  EXCLUDE: CONTIENE EVENTUALI DB2 SU CUI NON CREARE I JOBS
//*           (DEFAULT DUMMY)
//*  INPEXEC: CONTIENE IL JCL DA CREARE, NON VA MESSA LA SCHEDA JOB
//*           VANNO INSERITI I PARAMETRI DA MODIFICARE NEI TAG ½½
//*           ESEMPIO:
//*           //P010   EXEC DB20SQL,DB2=½DB2ID½,CEN=½CEN½,CENN=½CENN½
//*           //SYSIN    DD DISP=SHR,DSN=X½CENN½00DB2.TS000.ALTER
//*
//* 26.05.2023: SPOSTATA DOCUMENTAZIONE NEL JCL
//*
//*********************************************************************
//* PREPARAZIONE JOBS
//* RC=2 ->SUB=YES,MON=NO    RC=3 -> SUB=YES,MON=YES
//P010     EXEC PGM=IKJEFT01,REGION=0M,
// PARM=(DB2JOBS1,
//  '&AMB,&DESC,&SUB,&HOLD,&MSGCLASS,&CLASS',
//  '&FILTRO,&TYPE,&CEN,&CHIUSI',
//  '&MON,&PARLL,&FSCHV,&MAXP,&WAITM,&MAILB,&CONVERTI,&FORZACNV',
//  '&TESTLIB')
//SYSEXEC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB
//SYSPROC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB               00017500
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//INCLUDE  DD *
*
//STEPLIB  DD DSN=Y&CENN.00DB2.PE000.DSNLOAD,DISP=SHR                   00013400
//EXCLUDE  DD DUMMY
//INPEXEC  DD DUMMY
//TABDBACT DD DISP=SHR,DSN=X000DB2.TS000.DB2START.TUTTI
//GRPSHORT DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2(GRPSHORT),DISP=SHR
//TIMESTAM  DD DSN=&&TIMESTAM,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENO  DD DSN=&&JOBCENO,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENS  DD DSN=&&JOBCENS,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENT  DD DSN=&&JOBCENT,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENC  DD DSN=&&JOBCENC,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCEND  DD DSN=&&JOBCEND,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENP  DD DSN=&&JOBCENP,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//JOBCENF  DD DSN=&&JOBCENF,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//OUTCENO  DD SYSOUT=*
//OUTCENS  DD SYSOUT=*
//OUTCENT  DD SYSOUT=*
//OUTCENC  DD SYSOUT=*
//OUTCEND  DD SYSOUT=*
//OUTCENP  DD SYSOUT=*
//OUTCENF  DD SYSOUT=*
//JOBSMON  DD DSN=&&JOBSMON,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//TOTJOB   DD DSN=&&TOTJOB,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//TRACKER  DD DSN=&&TRACKER,DISP=(,PASS),
//            SPACE=(CYL,(1,1)),LRECL=80,RECFM=FB,BLKSIZE=9040
//OUTSMON  DD SYSOUT=*     COPIA DI JOBSMON
//* CANCELLA EVENTUALI TEMP. DA RUN PRECEDENTI NELLO STESSO JOB
//TOTJODEL DD DSN=&&TOTJOB,DISP=(MOD,DELETE),SPACE=(TRK,(1,1))
//TIMESDEL DD DSN=&&TIMESTAM,DISP=(MOD,DELETE),SPACE=(TRK,(1,1))
//TRACKDEL DD DSN=&&TRACKER,DISP=(MOD,DELETE),SPACE=(TRK,(1,1))
//LISTADEL DD DSN=&&JOBSMON,DISP=(MOD,DELETE),SPACE=(TRK,(1,1))
//*
// IF   (P010.RC > 4)  THEN
//P1DUD   EXEC DB20DUD,
//        RTC='04',
//        OPE='<',
//        CEN=&CEN
// ENDIF
//TESTSUB IF (P010.RC GT 1) AND (P010.RC < 5) THEN
//*
//* LANCIO JOBS DI SOTTTOMISSIONE E MONITORAGGIO REMOTO
//* SUI CENTRI PRESCELTI TRAMITE TWS
//*
//P090TWS  EXEC DB20TWSS,TXT='DB20JOBS',NUMJOB=&MAXP,
//         DESC=&DESC,TYPE=&TYPE,AUTH=&AUTH
//LISTAJOB DD DISP=(SHR,DELETE),DSN=&&JOBSMON
//*
//   IF  (P010.RC = 3) THEN
//*                                                                     00016400
//* MONITORAGGIO DEI JOB SOTTOMESSI (SU TUTTI I CENTRI)                 00016500
//*                                                                     00016600
//* IN CASO DI ERRORE DI QUALCHE JOB RC=8 SE DUD=YES ELSE RC=4          00016600
//*                                                                     00016600
//P092    EXEC PGM=IKJEFT01,
//     PARM=(REXSUB03,'&WAITM','&REPORT','&MAILB','&MAXRC','&START')
//SYSEXEC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB
//SYSPROC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB               00017500
//STEPLIB  DD DSN=Y&CENN.00DB2.PE000.DSNLOAD,DISP=SHR                   00013400
//SYSUDUMP DD DUMMY                                                     00016800
//SYSOUT   DD SYSOUT=*                                                  00016900
//TOTJOB   DD DSN=&&TOTJOB,DISP=(OLD,DELETE)
//TIMESTAM DD DSN=&&TIMESTAM,DISP=(OLD,DELETE)
//TRACKER  DD DSN=&&TRACKER,DISP=(OLD,DELETE)
//ISPLOG   DD SYSOUT=*,DCB=(LRECL=125,BLKSIZE=129,RECFM=VB)             00017600
//SYSTERM  DD SYSOUT=*                                                  00017800
//SYSTSPRT DD SYSOUT=*                                                  00017900
//SYSPRINT DD SYSOUT=*                                                  00018000
//SYSIN    DD DUMMY                                                     00018100
//SYSTSIN  DD DUMMY                                                     00018200
//*----------------------------------------------------------------*//
//*  FACCIO PASSO DI DUD O NO
//*----------------------------------------------------------------*//
//*
//P092DUDT EXEC PGM=IKJEFT01,PARM=('REXCFRYN,&DUD,Y')
//SYSEXEC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB
//SYSPROC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB
//SYSTSIN  DD DUMMY
//SYSIN    DD DUMMY
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*
// IF   ((P092DUDT.RC = 0) AND (P092.RC > 4))  THEN
//P092DUD  EXEC DB20DUD,
//        RTC='04',
//        OPE='<',
//        CEN=&CEN,
//        MAIL=&MAIL,MAILB=&MAILB,DESC=&MAILTXT
// ENDIF
// ENDIF
//TESTSUB ENDIF
