//DB20CHGM PROC DB2PAR=,DB2ARR=,CEN=,CENN=,ID1=XXXX,ID2=YYYYYYY,PROG=0,
// REORG=ALL,DYNUNLD=YES,ALLOW='',SAVE=YES,DBNAME=DBRXXX,CHKALL=NO,
// EXECJOB=0,SUBJOBS=1,DBVAR=YES,ALIAS=YES,SYN=YES,TESTLIB=,IDAAIGN=NO
//*********************************************************************
//*
//* PROCEDURA DI GESTIONE MODIFICHE BASI DATI DB2 DI SVILUPPO
//* GESTITA AUTOMATICAMENTE TRAMITE CHANGE MANAGER - BASELINE
//* PARAMETRI:
//*
//*  DB2PAR : INDICA IL DB2 DA CUI PARTIRE PER FARE IL CONFRONTO
//*  DB2ARR : INDICA IL DB2 SU CUI VIENE EFFETTUATA LA MODIFICA
//*  ID1    : IDENTIFICATIVO DI 4 CARATTERI
//*  ID2    : IDENTIFICATIVO DI 7 CARATTERI
//*  CHKALL : SERVE PER CONTROLLO RIALLINEAMENTO
//*  REORG  : PUÝ VALERE PEND (DEF.), ALL O ALTP
//*  DYNUNLD: PUÝ VALERE NO (PER I PARTIZIONATI) O YES (FA IN PARALLELO)
//*  ALLOW  : PUÝ VALERE REB O REO
//*  DBNAME : DATABASE IN CUI SONO CONTENUTE LE MODIFICHE
//*  SAVE   : PER SALVARE O MENO I DATI CONTENUTI NELLE TABELLE
//*  EXECJOB: CON 0 NON ESEGUE SUB DI ESECUZIONE, CON 1 ESEGUE DDL
//*  SUBJOBS: CON 0 NON ESEGUE SUB DI DELDEF BASELINE SU DB2PAR
//*  IDAAIGN: SERVE PER IGNORARE WARNING DI IDAA NELL'ANALYZE (DEF. NO)
//*
//*  NOTE OPERATIVE - RIESEGUIRE SEMPRE DALL'INIZIO SE VA ABEND
//*
//*  ESEMPIO INPUT PER DBNAME E DIPENDENZE :
//*  //P010GBP.INPBL DD *
//*  DB DBR999 S
//*
//* E' STATO INSERITO LO STEP X120DEL CHE ELIMINA TUTTI I DATASET
//* DI LAVORO TRANNE IL PDS CON IL CDL E IL JOB DI EXEC
//*
//*
//**********************************************************************
//*
//* EXPORT DEI SIMBOLI DA UTILIZZARE NEGLI INPUT IN STREAM
//*
//P000EXP  EXPORT SYMLIST=(DB2PAR,DB2ARR,ID2,DBNAME,CENN,PROG,DASH,
//         REORG,EXECJOB,SUBJOBS)
//P000SET  SET DB2PAR=&DB2PAR,DB2ARR=&DB2ARR,ID2=&ID2,DBNAME=&DBNAME,
//             CENN=&CENN,PROG=&PROG,DASH='-',REORG=&REORG,
//             EXECJOB=&EXECJOB,SUBJOBS=&SUBJOBS
//*
//*   ALLOCAZIONE DATASET WORKLIST
//*
//*
//DELETEDS  EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=(JCLONLY,REPDD)
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKJBL
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKCMP
 SET MAXCC = 0
//REPDD DD SYSOUT=*
//*
//ALLOCADS EXEC PGM=IEFBR14
//WORKL001 DD DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL,
//   DISP=(,CATLG),SPACE=(CYL,(1,10)),LRECL=80,RECFM=FB,BLKSIZE=8000
//*
//*
//* VERIFICHE E GENERAZIONE BASELINE PROFILE
//*
//P010GBP EXEC PGM=IKJEFT01,
//      PARM=(REXBSL01,'&DB2PAR,&DB2ARR,&ID1,&ID2,&DBNAME,&CHKALL',
//   '&PROG,&REORG,&DYNUNLD,&ALLOW,&SAVE,NO,NO,&DBVAR,&ALIAS,&SYN',
//   ',,&IDAAIGN')
//STEPLIB  DD DSN=Y&CENN.00LE37.PE000.SCEERUN,DISP=SHR
//         DD DSN=Y&CENN.00DB2.PE000.DSNLOAD,DISP=SHR
//SYSEXEC  DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB
//SYSPROC  DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB,DISP=SHR
//PARMDD   DD DUMMY
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//SKCMP    DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELCMPB),DISP=SHR
//SKIMP    DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELIMP),DISP=SHR
//SKANA    DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELANA),DISP=SHR
//SKEXE1   DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELEXE1),DISP=SHR
//SKEXE2   DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELEXE2),DISP=SHR
//SKPOFIN  DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKPOFIN),DISP=SHR
//SKJBL    DD DSN=L&CEN.P00.SYSTEM.INPUT.DB2&TESTLIB(SKELJBL),DISP=SHR
//INPBL  DD DUMMY
//*
// IF (P010GBP.RC GT 4) THEN
//P010DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P010GBP - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
// IF (&SUBJOBS=1) THEN
//*
//* ESEGUO PER DEFINIRE BL SU DB2PAR
//*
//P020GBL EXEC PGM=IKJEFT01,PARM=('REXSUB01')
//STEPLIB DD DSN=Y&CENN.00DB2.PE000.DSNLOAD,DISP=SHR
//        DD DSN=L&CEN.P0Y.TBAN0000.LOADBATC,DISP=SHR
//SYSTSIN DD DUMMY
//SYSUDUMP DD DUMMY
//SYSOUT   DD SYSOUT=*
//SYSEXEC DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB,DISP=SHR
//SYSPROC DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB,DISP=SHR
//JOBDASUB DD DISP=SHR,
//       DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKJBL
//SYSTERM DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD DUMMY
// IF (P020GBL.RC GT 4) THEN
//P020DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P020GBL - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//* CANCELLAZIONE BASELINE DB2ARR
//*
//P030CNB  EXEC PGM=ACMBMAN,
//    REGION=0M,PARM='&DB2ARR.OPD1',
//    COND=(4,LT)
//STEPLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//         DD DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//         DD DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//         DD DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//ABNLIGNR DD DUMMY
//ALUPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//ALUIN    DD *,SYMBOLS=(JCLONLY,REPDD)
  SSID &DB2ARR
  COMMIT 500
  SOURCETYPE CATALOG
  BLPROFILE BLP&DB2ARR..H&DBNAME.&ID2&PROG
  BLNAME BL&DB2ARR..H&DBNAME.&ID2&PROG
  NOBASELINE
  OVERRIDE( BASELINE-DELETE )
  DELETEAGE 2
  RETAINMAX 0
//REPDD DD SYSOUT=*
//*
// IF (P030CNB.RC GT 4) THEN
//P030DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P050CNB  - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//* CANCELLAZIONE BASELINE DB2ARR PER
//*
//P040CBL1 EXEC PGM=ACMBMAN,
//    REGION=0M,PARM='&DB2ARR.OPD1',
//    COND=(4,LT)
//STEPLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//         DD DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//         DD DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//         DD DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//ABNLIGNR DD DUMMY
//ALUPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//ALUIN    DD *,SYMBOLS=(JCLONLY,REPDD)
  SSID &DB2ARR
  COMMIT 500
  SOURCETYPE CATALOG
  BLPROFILE BLP&DB2ARR..H&DBNAME.&ID2&PROG
  BLNAME BL&DB2ARR..H&DBNAME.&ID2&PROG
  DELETEAGE 2
  RETAINMAX 0
//REPDD DD SYSOUT=*
//*
// IF (P040CBL1.RC GT 4) THEN
//P040DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P050CBL1 - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
// ENDIF
//*
//* FASE DI COMPARE DEL CHANGE MANAGER
//*
//P050CMP EXEC PGM=ACMCMAN,
//    REGION=0M,PARM='&DB2ARR.OPD1',
//    COND=(4,LT)
//STEPLIB DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//        DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//        DD  DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//ABNLIGNR DD DUMMY
//ALUPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//ALUIN    DD DISP=SHR,
//       DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKCMP
//CDL001   DD DISP=SHR,
//      DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR(CDLBL)
//*
// IF (P050CMP.RC GT 4) THEN
//P050DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P050CMP - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//* VERIFICA SE CI SONO DIFFERENZE
//*
// IF (P050CMP.RC NE 1) THEN
//*
//* FASE DI IMPORT DEL CHANGE MANAGER (SE TROVATE DIFFERENZE)
//*
//P060IMP  EXEC PGM=ACMIMAN,REGION=0M,
//             PARM='&DB2ARR.OPD1'
//STEPLIB DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//        DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//        DD  DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//ABNLIGNR DD DUMMY
//ALUPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//IMPORTIN DD DISP=SHR,
//    DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR(CDLBL)
//ALUIN    DD DISP=SHR,
//       DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKIMP
//*
// IF (P060IMP.RC GT 4) THEN
//P060DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P060IMP - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//* FASE DI ANALYZE
//*
//P070ANA  EXEC PGM=ALUAMAIN,
//        REGION=0M,
//        PARM='&DB2ARR.OPD1'
//STEPLIB DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//        DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//        DD  DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//SYSPROC  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCCLIB,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCCLIB,DISP=SHR
//ABNLIGNR DD DUMMY
//SYSUDUMP DD SYSOUT=*
//ALUPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//AJXPOFVL DD DUMMY
//ALUIN    DD DISP=SHR,
//   DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKANA
//AJXPOFIN DD DISP=SHR,
//   DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKPOF
//WORKL001 DD DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL,
//   DISP=SHR
//*
// IF (P070ANA.RC GT 4) THEN
//P070DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P070ANA - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
//* CANCELLO WORKLIST IN CASO DI ABEND
//*P070DEL EXEC PGM=IEFBR14
//*WORKL001 DD DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL,
//*   DISP=SHR
// ENDIF
//*
//*
//* PASSI DI GENERAZIONE JOB DI EXECUTE (SE TUTTO OK)
//*
//P080PRF EXEC PGM=IEBCOPY
//ISPMLIB DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCTLIB,DISP=SHR
//OUT      DD SPACE=(TRK,(2,1,3)),DISP=(NEW,PASS),
//            DSN=&&TPRF1
//SYSPRINT DD DUMMY
//SYSIN    DD DISP=SHR,DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB(DB2UDCXI)
//*
// IF (P080PRF.RC GT 4) THEN
//P080DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P080PRF - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//P090IEB EXEC PGM=IEBGENER
//SYSUT2   DD SPACE=(TRK,(1,1)),DISP=(NEW,PASS),
//    DSN=&&TSIN1,
//            DSORG=PS,LRECL=80,BLKSIZE=3200,RECFM=FB
//SYSIN    DD DUMMY
//SYSPRINT DD DUMMY
//SYSUT1   DD *
//*
//* GENERAZIONE JCL DI EXEC
//*
//P100GEN EXEC PGM=AJXBMAIN,
//     REGION=0M,PARM='&DB2ARR.OPD1'
//STEPLIB DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCLINK,DISP=SHR
//        DD  DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCLINK,DISP=SHR
//        DD  DSN=L&CEN.P00.SYSTEM.PRM.DB2,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNEXIT,DISP=SHR
//        DD  DSN=Y&CENN.00DB2.PE000.&DB2ARR..DSNLOAD,DISP=SHR
//ABNLIGNR DD DUMMY
//AJXERR   DD SYSOUT=*
//ISPPROF  DD DSN=&&TPRF1,DISP=(OLD,PASS)
//SYSPROC  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCCLIB,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCCLIB,DISP=SHR
//ACT$MSGS DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCMLIB,DISP=SHR           SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCMLIB,DISP=SHR
//ISPMLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCMLIB,DISP=SHR           SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCMLIB,DISP=SHR
//         DD DSN=SYS1.SISPMENU,DISP=SHR
//ISPSLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCSLIB,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCSLIB,DISP=SHR
//ISPTLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCTLIB,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCTLIB,DISP=SHR
//ISPPLIB  DD DSN=Y&CENN.00BMC.PE000.CHGMAN.UBMCPLIB,DISP=SHR
//         DD DSN=Y&CENN.00BMC.PE000.CHGMAN.BMCPLIB,DISP=SHR
//ISPCTL0  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//ISPCTL1  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//ISPCTL2  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//ISPCTL3  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//ISPWRK1  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=256,BLKSIZE=2560,RECFM=FB)
//ISPWRK2  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=256,BLKSIZE=2560,RECFM=FB)
//ISPWRK3  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=256,BLKSIZE=2560,RECFM=FB)
//ISPCNTL  DD SPACE=(CYL,(5,5)),UNIT=SYSALLDA,DISP=(,PASS),
//         DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//SYSTSIN  DD SPACE=(TRK,(1,1)),DISP=(OLD,PASS),
//            DSN=&&TSIN1,
//            DSORG=PS,LRECL=80,BLKSIZE=3200,RECFM=FB
//ISPLOG   DD SYSOUT=*,
//         DSORG=PS,LRECL=125,BLKSIZE=129,RECFM=VA
//SYSTSPRT DD SYSOUT=*,
//            DSORG=PS,LRECL=137,BLKSIZE=3155,RECFM=VBA
//AJXPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//AJXJCL   DD DISP=SHR,
// DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR(EXEC)
//WORKLIST DD DISP=SHR,
//  DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL
//AJXIN  DD DISP=SHR,
//   DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKE1
//AJXPOFIN DD DISP=SHR,
//   DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKE2
//*
// IF (P100GEN.RC GT 4) THEN
//P100DUD EXEC DB20DUD,
//    DESC='DB2: ANOMALIA STEP P100GEN - PROC DB20CHGM ',
//    RTC='04',
//    OPE='<',
//    STEP='',
//    MAIL='NO',
//    CEN=&CEN,
//    MAILB=MDB2
// ENDIF
//*
//* ESEGUO TEST PER SOTTOMETTERE JOB DI EXECUTION SU TARGET EXECJOB
//*
// IF (&EXECJOB=1) THEN
//*
//*
//* LANCIO JOB DI EXECUTE SUL DB2 DI ARRIVO
//*
//P110EXE EXEC DB20JOBS,CEN=&CEN,SUB=YES,DESC=MS4,AMB=ALL,MSGCLASS=Y,
//     CHIUSI=NO,MON=YES,DUD=YES,MAIL=ALL,MAILB=MDB2,
// MAILTXT='ANOMALIA-STEP-P110EXE-DB20JOBS',FILTRO=CEN(*ALL*),
// TESTLIB=&TESTLIB
//INCLUDE DD *,SYMBOLS=(JCLONLY,REPDD)
&DB2ARR
//INPEXEC DD DISP=SHR,
//        DSN=X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR(EXEC)
//        DD DSN=L&CEN.P00.SYSTEM.INPUT&TESTLIB(SKDUDDB2),DISP=SHR
//REPDD DD SYSOUT=*
//*
//*
// ENDIF
//*
//* CANCELLAZIONE WKLIST
//*
//P120DEL   EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *,SYMBOLS=(JCLONLY,REPDD)
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKANA
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKE1
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKE2
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKIMP
 DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKPOF
 SET MAXCC = 0
//REPDD DD SYSOUT=*
// ENDIF
//**** DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..WKL
//**** DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKJBL
//**** DELETE X&CENN.00DB2.TW000.U&ID2..&DBNAME..&DB2ARR..SKCMP
